packages/windmapper/windmapper-2.1.10-cp38-cp38-macosx_13_0_x86_64.whl/windmapper-2.1.10.data/data/share/windninja/ninjafoam/8/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    north_face
    {
        type            fixedValue;
        value           uniform 1;
    }

    west_face
    {
        type            zeroGradient;
    }

    east_face
    {
        type            zeroGradient;
    }

    south_face
    {
        type            zeroGradient;
    }

    minZ
    {
        type            zeroGradient;
    }

    maxZ
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
